<?php
//Փոթոխականի տիպերը
//int - ամբողջ թվեր
//float - տասնորդական թվեր
//string - տեքստե, տող
//bool - տրամաբանական true(1), false(0)
//null - դատարկ տիպ
//array - տարրեի ամբողջություն՝ զանգված
//object - օբյեկտ(OOP)
//resource - ռեսուրսներ՝ հղումներ որոշակի արտաքին ռեսուրսների

//փոփոխականները հայտարարվում և օգտագործվում են $-ի օգնությամբ, օրինակ $x = 1;

//մաթեմատիկական օպերատորներ
//+ գումարում,
//- հանում,
//* բազմապատկում,
// / բաժանում,
// % մնացորդով բաժանում, վերադարձնում է բաժանումից ստացված մնացորդը


//բարդ վերագրման օպերատորներ՝ +=, -=, *=, /=, %=

// increment & decrement` ++, --

// համեմատական օպերատորներ
//> մեծ է,
//< փոքր է,
//<= մեծ է կամ հավասար,
//>= փոքր է կամ հավասար,
//== հավասար է,
//=== խիստ հավասար է,
//!= հավասար չէ,
//!== խիստ հավասար չէ

//տվյալների արտածման համար օգտագործվում է echo հրամանը, որը տվյալներն արտածում է էկրանին

//տողի վերջում ;-ը պարտադիր է բոլոր դեպքերում, բացառությամբ {}-ից հետոի


